### Terraform Plan: `dev/03-eks-cluster`

<details>
<summary>Show Plan</summary>

```terraform
data.terraform_remote_state.iam: Reading...
data.terraform_remote_state.vpc: Reading...
module.eks_cluster.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks_cluster.data.aws_partition.current: Reading...
module.eks_cluster.data.aws_caller_identity.current: Reading...
module.eks_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_cluster.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 0s [id=851725636341]
module.eks_cluster.data.aws_caller_identity.current: Read complete after 0s [id=851725636341]
module.eks_cluster.data.aws_iam_policy_document.kms_key_policy: Reading...
module.eks_cluster.data.aws_iam_policy_document.kms_key_policy: Read complete after 0s [id=1817731308]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.eks_cluster.aws_cloudwatch_log_group.eks will be created
  + resource "aws_cloudwatch_log_group" "eks" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/eks/eks-gitops-dev-eks/cluster"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "ClusterName" = "eks-gitops-dev-eks"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "eks-cluster"
          + "Name"        = "eks-gitops-dev-eks-eks-logs"
        }
      + tags_all                    = {
          + "ClusterName" = "eks-gitops-dev-eks"
          + "CostCenter"  = "engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "eks-cluster"
          + "Name"        = "eks-gitops-dev-eks-eks-logs"
          + "Project"     = "eks-gitops"
          + "Repository"  = "aws-eks-production"
        }
    }

  # module.eks_cluster.aws_kms_alias.eks will be created
  + resource "aws_kms_alias" "eks" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks-gitops-dev-eks-eks"
      + name_prefix    = (known after apply)
      + region         = "us-east-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks_cluster.aws_kms_key.eks will be created
  + resource "aws_kms_key" "eks" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for EKS cluster eks-gitops-dev-eks secrets encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::851725636341:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "kms:ViaService" = "eks.us-east-1.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow EKS to use the key"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:us-east-1:851725636341:log-group:/aws/eks/eks-gitops-dev-eks/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-1.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "us-east-1"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "ClusterName" = "eks-gitops-dev-eks"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "eks-cluster"
          + "Name"        = "eks-gitops-dev-eks-eks-secrets"
        }
      + tags_all                           = {
          + "ClusterName" = "eks-gitops-dev-eks"
          + "CostCenter"  = "engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "eks-cluster"
          + "Name"        = "eks-gitops-dev-eks-eks-secrets"
          + "Project"     = "eks-gitops"
          + "Repository"  = "aws-eks-production"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kms_key_arn = (known after apply)
  + kms_key_id  = (known after apply)

Warning: Deprecated attribute

  on ../../../modules/eks-cluster/kms.tf line 87, in data "aws_iam_policy_document" "kms_key_policy":
  87:       values   = ["eks.${data.aws_region.current.name}.amazonaws.com"]

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 5 more similar warnings elsewhere)

Error: Unable to find remote state

  with data.terraform_remote_state.vpc,
  on data.tf line 7, in data "terraform_remote_state" "vpc":
   7: data "terraform_remote_state" "vpc" {

No stored state was found for the given workspace in the given backend.

Error: Unable to find remote state

  with data.terraform_remote_state.iam,
  on data.tf line 18, in data "terraform_remote_state" "iam":
  18: data "terraform_remote_state" "iam" {

No stored state was found for the given workspace in the given backend.

```

</details>

**Plan Status:** ✅ Success
